In [2]:
# Reading csv data using pandas

import pandas as pd
data=pd.read_csv("file1.csv")
data

      NAME  AGE           CITY
0    ALICE   25       NEW YORK
1      BOB   30  SAN FRANCISCO
2  CHARLIE   22    LOS ANGELES

In [4]:
# Read Data from CSV Files to Pandas DataFrames

import pandas as pd
file_path="file1.csv"
df=pd.read_csv(file_path)
df

      NAME  AGE           CITY
0    ALICE   25       NEW YORK
1      BOB   30  SAN FRANCISCO
2  CHARLIE   22    LOS ANGELES

In [6]:
# Filter Data in Pandas DataFrame using query:
import pandas as pd
file_path='file1.csv'
df=pd.read_csv(file_path)
print("Original DataFrame:")
print(df)

column_name='AGE'
filtered_data=df.query(f"{column_name}>22")
print(f"\nFiltered DataFrame where {column_name}>22:")
print(filtered_data)

Original DataFrame:
      NAME  AGE           CITY
0    ALICE   25       NEW YORK
1      BOB   30  SAN FRANCISCO
2  CHARLIE   22    LOS ANGELES

Filtered DataFrame where AGE>22:
    NAME  AGE           CITY
0  ALICE   25       NEW YORK
1    BOB   30  SAN FRANCISCO